{
  "pages": {
    "home": {
      "bio": {
        "title": "Junior Web Developer",
        "subtitle": "My goal is to create aesthetically pleasing and functional solutions through code and design. With a growing portfolio of successful projects, I am committed to continuously advancing my skills and knowledge. I am eager to bring my expertise and passion to a collaborative team, where I can contribute effectively, learn from others, and grow alongside talented professionals.",
        "followButton": "Follow",
        "followButtonClicked": "Following"
      },
      "about": {
        "title": "Let's talk about me...",
        "texts": [
          "I'm Benja, a programmer based in Buenos Aires, Argentina. My journey in programming began in May 2021 when I started a course at APX School, an interactive platform that allows students to progress at their own pace.",
          "Before that, I was already interested in coding and learned Python through YouTube tutorials by Mosh Hamedi.",
          "I'm a fast learner with a keen eye for detail. I'm always eager to make new connections, take on new challenges, and deliver my best work.",
          "I love learning new stuff, i am currently on my way to develop my first native app. Which will be quite a challenge. I am studying at Udemy, completed a next 14 course as well as underway to complete my native course.",
          "Aside from programming, I'm passionate about electronic music, especially techno. I've been a DJ and producer since high school. Check out my music on Spotify"
        ],
        "link": "here"
      },
      "feed": {
        "tweets": [
          "Hello there! My name is Benjamin Henley Saubidet, and welcome to my developer page. I'm a full-stack JavaScript developer with 3 years of experience in full-stack, backend, and frontend development. I am deeply passionate about my craft and always strive for excellence in my work Currently, I am expanding my skills by studying React Native for mobile app development.",
          "I have been a freelance developer for 3 years, and I am currently seeking an opportunity to join a dynamic development team that values Agile methodologies.",
          [
            "📚 EDUCATION 📚",
            "School: St. Matthews College (2006-2018) ",
            " School: University of Buenos Aires (Biochemistry) (2018-2020) ",
            " Terciary: APX School (2021-2023) ",
            " Terciary: Udemy - Next.js: The React framework for production (03/2024 - 06/2024) ",
            " Terciary: Udemy - React Native: Native applications for IOS and Android (06/2024 - now) "
          ],
          "If you would like to get in contact with me, please fill out the form below!"
        ]
      },
      "projects": {
        "tweets": [
          "Check out my e-commerce backend, complete with comprehensive Postman documentation.",
          "Looking to have fun in Ibiza? I recommend renting a jetski to explore the beautiful sights this island has to offer. I designed a powerful algorithm that checks the availability of both guides and jetskis, along with a robust backend using Firebase. This ensures you can easily rent a jetski and enjoy a smooth experience.",
          "I've had a great experience working with Panorama Minero, a company at the forefront of the mining industry. They have been pleased to work with me on multiple occasions. This time, I improved the UI by internationalizing the page, making it accessible in both English and Spanish. Additionally, I collaborated with a design team to add newsections to the page.",
          "International Women in Mining (IWiM) is an international organization run by volunteers committed to the advancement of women in the mining sector. I was happy to develop this page dedicated to the inclusion and visibility of the female workforce.",
          "I had the privilege of contributing to the creation of Panorama Minero's Gold, Silver, and Copper page. This project involved extensive collaboration to develop a comprehensive and visually appealing resource for users interested in these key mining sectors. I internationalized the page, making it accessible in both English and Spanish, which broadened its reach to a wider audience. Additionally, I optimized the user interface to ensure a seamless and engaging experience, integrating intuitive navigation and interactive elements. My work improved the page's usability and accessibility, adding significant value to Panorama Minero by attracting a more diverse and global audience.",
          "My first solo project was a great success. I designed a web page for Buenos Aires Vision, a tourism company known for providing the best selection of tours in Buenos Aires. Their offerings range from exquisite dining experiences to river explorations, ensuring a memorable stay for visitors. My role involved showcasing these tours in an elegant and appealing manner, which effectively attracted clients and increased the company's revenue.",
          "My most ambitious project yet is designing a web app with React Native. Tuki will be used to get food from different places. These places offer special boxes with random items chosen by the store."
        ]
      },
      "skillset": {
        "title": "My Skillset",
        "texts": [
          "I am proficient in JavaScript and TypeScript, with a strong knowledge of both SQL and NoSQL databases including Firebase Cloud Firestore, Firebase Realtime Database, and PostgreSQL. I enjoy working on React-based projects with Next.js and have experience deploying applications on Heroku and Vercel. From initial layout and architecture to a fully functional web app, I can handle the entire development process. Additionally, I am bilingual, fluent in both English and Spanish, which enhances my ability to collaborate in diverse teams.",
          "During my time at Panorama Minero, I worked closely with other dedicated professionals, collaborating on projects aimed at enhancing the user interface and internationalizing web pages. Together, we implemented new sections and optimized accessibility in both English and Spanish, significantly expanding the platform's reach and audience. This enriching experience not only improved my technical skills but also strengthened my ability to work in a collaborative and dynamic environment.",
          "At ibijetrent, I worked closely with a frontend developer, enhancing my teamwork skills. We collaborated on integrating complex functionalities, ensuring constant and effective communication to align our goals and solve problems in real-time. This project allowed me to apply my technical knowledge in JavaScript, TypeScript, React, and Next.js, while also improving my ability to coordinate and collaborate with other professionals, thus enhancing the quality of the final product and optimizing user experience. Through regular meetings, idea exchanges, and continuous feedback, we managed to develop a robust and efficient application that met the requirements and expectations of our users.",
          "I have extensive experience with Postman, which has equipped me with the skills to build robust backends with CRUD operations. Check out the Projects tab to see my apps along with their respective documentation. My expertise extends to setting up and maintaining RESTful APIs, ensuring secure and efficient data exchange between the frontend and backend.",
          "Moreover, I am adept at using powerful tools like Airtable and Algolia to enhance the functionality and user experience of my applications. I am also familiar with deploying applications on GitHub Pages, Vercel, and Heroku. Unfortunately, Heroku's recent removal of free dynos has left many of my applications without a host. Despite this, I have continued to explore alternative hosting solutions to ensure the accessibility and reliability of my projects."
        ]
      }
    },
    "soundcloud": {
      "options": {
        "list": ["All, Popular Tracks, Tracks, Playlists"]
      },
      "followButton": "Follow",
      "followButtonClicked": "Following",
      "stationButton": "Station"
    }
  },
  "ui": {
    "soundcloud": {
      "rightbar": {
        "texts": [
          "Benjamin Henley Saubidet, born in Buenos Aires, Argentina in the year 2000, is a techno DJ & producer. His passion for electronic music blossomed after finishing school and entering the real world, where he got a job and started investing in what would soon become his future.",
          "His career as a producer began with his first release, thanks to local DJ and now Drumcode artist Nicolas Taboada, who selected him for DJ Mag's first techno compilation.",
          "His sound is characterized by dancy, yet sometimes melancholic melodies. He's a big fan of sound design and all of his tracks possess an array of original stabs, growls, and FX that make his sound unique.",
          "He is currently signed on IAMT Red, Invicta, Nova Collective, Redlof, Kaligo, Reload Black, DJ Mag LA, Infekted, Made in Brussels, Spacekraft, & Future Techno."
        ]
      }
    },
    "leftbar": {
      "items": [
        "PROFILE",
        "LINKEDIN",
        "GITHUB",
        "INSTAGRAM",
        "MUSIC",
        "LANGUAGE"
      ],
      "languages": {
        "en": "English (UK)",
        "es": "Spanish (ES)"
      }
    },
    "rightbar": {
      "trends": {
        "title": "What's Happening",
        "list": [
          { "title": "Apple's IOS 18.1", "category": "Technology - Trending" },
          { "title": "#OpenAI's new voice", "category": "AI - Trending" },
          { "title": "AWS's AI Strategy", "category": "AI - Trending" },
          { "title": "Razer Blackshark V2", "category": "Equipment in USA" },
          { "title": "#React_19", "category": "Technology - Trending" },
          { "title": "Meta's New AI Tools", "category": "AI - Trending" }
        ],
        "posts": "posts",
        "more": "Show More"
      }
    },
    "optionsMenu": {
      "options": [
        { "option": "Feed", "id": "feed" },
        { "option": "About", "id": "about" },
        { "option": "Projects", "id": "projects" },
        { "option": "Skillset", "id": "skills" }
      ]
    },
    "twitter": {
      "trends": {
        "posts": "posts",
        "title": "What's Happening",
        "list": [
          {
            "title": "Apple's IOS 18.1",
            "tag": "Technology - Trending",
            "posts": "302k",
            "url": "https://www.theverge.com/2024/7/29/24208732/apple-intelligence-ai-ios-18-1-developer-beta-launch-iphone"
          },
          {
            "title": "#OpenAI's new voice",
            "tag": "AI - Trending",
            "posts": "453k",
            "url": "https://techcrunch.com/2024/07/30/openai-releases-chatgpts-super-realistic-voice-feature/"
          },
          {
            "title": "AWS's AI Strategy",
            "tag": "AI - Trending",
            "posts": "216k",
            "url": "https://www.cnbc.com/video/2024/07/01/aws-ceo-matt-garman-breaks-down-the-companys-ai-strategy.html?&qsearchterm=aws"
          },
          {
            "title": "Razer Blackshark V2",
            "tag": "Equipment in USA",
            "posts": "339k",
            "url": "https://www.zdnet.com/home-and-office/home-entertainment/razer-blackshark-v2-pro-review/"
          },
          {
            "title": "#React_19",
            "tag": "Technology - Trending",
            "posts": "127k",
            "url": "https://react.dev/blog/2024/04/25/react-19-upgrade-guide"
          },
          {
            "title": "Meta's New AI Tools",
            "tag": "AI - Trending",
            "posts": "400k",
            "url": "https://www.engadget.com/metas-next-hardware-project-might-be-ai-infused-headphones-with-cameras-204741102.html"
          }
        ],
        "more": "Show More"
      },
      "people": {
        "title": "Relevant people",
        "list": [
          {
            "name": "Elon Musk",
            "at": "@elonmusk",
            "url": "https://twitter.com/elonmusk"
          },
          {
            "name": "Sundar Pichai",
            "at": "@sundarpichai",
            "url": "https://twitter.com/sundarpichai"
          },
          {
            "name": "Tim Cook",
            "at": "@tim_cook",
            "url": "https://twitter.com/tim_cook"
          },
          {
            "name": "Satya Nadella",
            "at": "@satyanadella",
            "url": "https://twitter.com/satyanadella"
          },
          {
            "name": "Susan Wojcicki",
            "at": "@SusanWojcicki",
            "url": "https://twitter.com/SusanWojcicki"
          },
          {
            "name": "Jeff Bezos",
            "at": "@JeffBezos",
            "url": "https://twitter.com/JeffBezos"
          }
        ]
      }
    }
  }
}
